tutorials/combustion/fireFoam/LES/compartmentFire/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate
        {
            type table;
            file "<constant>/massLossRate";
        }
        value           uniform (0 0 0);
    }

    entrainment
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    region0_to_panelRegion_wallPanel
    {
        type            slip;
    }

    region0_to_panelRegion_internalWallPanel_top
    {
        type            slip;
    }

    region0_to_panelRegion_internalWallPanel_bottom
    {
        type            slip;
    }
}


// ************************************************************************* //
